## Question 1 - Display all movies titles.

## This query retrieves all movie titles available in the sakila database.
## Table used = "film"

In [ ]:
import pandas as pd
import mysql.connector

conn = mysql.connector.connect(
	host = 'localhost',
	user = 'root',
	password = '17wiknacAbc!',
	database = 'sakila'
)
query_1 = """
Select title from film;
"""
df_titles = pd.read_sql(query_1, conn)

df_titles.to_csv("../reports/Question1_movie_titles.csv", index = False)

In [4]:
df_titles.head(10)

              title
0  ACADEMY DINOSAUR
1    ACE GOLDFINGER
2  ADAPTATION HOLES
3  AFFAIR PREJUDICE
4       AFRICAN EGG
5      AGENT TRUMAN
6   AIRPLANE SIERRA
7   AIRPORT POLLOCK
8     ALABAMA DEVIL
9  ALADDIN CALENDAR

## Question 2 - Show list of unique video categories.

## This query retrieves all unique video categories available in the sakila database.
## Table used = "category"

In [ ]:
import pandas as pd
import mysql.connector

conn = mysql.connector.connect(
	host = 'localhost',
	user = 'root',
	password = '17wiknacAbc!',
	database = 'sakila'
)
query_2 = """
Select distinct name from category;
"""
df_category = pd.read_sql(query_2, conn)

df_category.to_csv("../reports/Question2_video_categories.csv", index = False)

In [7]:
df_category.head(10)

          name
0       Action
1    Animation
2     Children
3     Classics
4       Comedy
5  Documentary
6        Drama
7       Family
8      Foreign
9        Games

## Question 3 - Number movies in each category.

## Display how many films exist in each category.
## Table used = "film, film_category, category"

In [9]:
import pandas as pd
import mysql.connector

query_3 = """
Select c.name AS category, Count(f.film_id) AS film_count
from film f
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON c.category_id = fc.category_id
Group by c.name;
"""
df_numberMovies = pd.read_sql(query_3, conn)
df_numberMovies.to_csv("../reports/Question3_Number_Movies.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\3370681282.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_numberMovies = pd.read_sql(query_3, conn)

In [11]:
df_numberMovies.head(5)

    category  film_count
0     Action          64
1  Animation          66
2   Children          60
3   Classics          57
4     Comedy          58

## Question 4 - Show actors whose last name starts with "S".

## Lists all actors whose last names begin with the letter "S".
## Table used = "actor"

In [12]:
query_4 = """
Select first_name, last_name from actor Where last_name LIKE '%s';
"""
df_lastName = pd.read_sql(query_4, conn)
df_lastName.to_csv("../reports/Question4_lastName_actor.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\4040984064.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_lastName = pd.read_sql(query_4, conn)

In [15]:
df_lastName.head(5)

  first_name  last_name
0   PENELOPE    GUINESS
1   JENNIFER      DAVIS
2       BURT    DUKAKIS
3      JODIE  DEGENERES
4    FRANCES  DAY-LEWIS

## Question 5 - List films with their main actors.

## Displays each film with the names of its actors.
## Table used = "film, film_actor, actor"

In [17]:
query_5 = """
select f.title, a.first_name, a.last_name
from film f
JOIN film_actor fa ON f.film_id = fa.film_id
JOIN actor a ON a.actor_id = fa.actor_id;
"""
df_mainActors = pd.read_sql(query_5, conn)
df_mainActors.to_csv("../reports/Question5_mainActors.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\2025731911.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_mainActors = pd.read_sql(query_5, conn)

In [19]:
df_mainActors.head()

                   title first_name last_name
0       ACADEMY DINOSAUR   PENELOPE   GUINESS
1   ANACONDA CONFESSIONS   PENELOPE   GUINESS
2            ANGELS LIFE   PENELOPE   GUINESS
3  BULWORTH COMMANDMENTS   PENELOPE   GUINESS
4          CHEAPER CLYDE   PENELOPE   GUINESS

## Question 6 - Comedy films longer than 100 minutes.

## Show all comedy movies longer than 100 minutes.
## Table used = "film, film_category, category"

In [20]:
query_6 = """
Select f.title, f.length
from film f
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON c.category_id = fc.category_id
WHERE c.name = 'Comedy' AND length > 100;
"""
df_comedyFilms = pd.read_sql(query_6, conn)
df_comedyFilms.to_csv("../reports/Question6_Comedy_Films.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\3982756131.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_comedyFilms = pd.read_sql(query_6, conn)

In [22]:
df_comedyFilms.head()

                    title  length
0     BRINGING HYSTERICAL     136
1           CAPER MOTIONS     176
2           CAT CONEHEADS     112
3  CONNECTION MICROCOSMOS     115
4          CONTROL ANTHEM     185

## Question 7 - Top 5 customers by total spending.

## Finds the top 5 customers who spent the most on rentals.
## Table used = "customer, payment"

In [ ]:
query_7 = """
Select c.first_name, c.last_name, Sum(p.amount) as total_spent
from customer c
Join payment p ON c.customer_id = p.customer_id
Group by c.customer_id
order by total_spent desc
limit 5
"""
df_top5customers = pd.read_sql(query_7, conn)
df_top5customers.to_csv("../reports/Question7_Top5Customers.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\567759926.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_top5customers = pd.read_sql(query_7, conn)

In [24]:
df_top5customers.head()

  first_name last_name  total_spent
0       KARL      SEAL       221.55
1    ELEANOR      HUNT       216.54
2      CLARA      SHAW       195.58
3     MARION    SNYDER       194.61
4     RHONDA   KENNEDY       194.61

## Question 8 - Number of rentals per customer.

## Counts how many rentals each customer made.
## Table used = "customer, rental"

In [29]:
from sqlalchemy import create_engine
engine =  create_engine("mysql+mysqlconnector://root:17wiknacAbc!@localhost/sakila")
query_8 = """
select c.first_name, c.last_name, count(r.rental_id) AS rental_count
from customer c
Join rental r ON c.customer_id = r.customer_id
Group by c.customer_id;
"""
df_Number_Rentals = pd.read_sql(query_8, engine)
df_Number_Rentals.to_csv("../reports/Question8_Number_Rentals.csv", index = False)

In [30]:
df_Number_Rentals.head()

  first_name last_name  rental_count
0       MARY     SMITH            32
1   PATRICIA   JOHNSON            27
2      LINDA  WILLIAMS            26
3    BARBARA     JONES            22
4  ELIZABETH     BROWN            38

## Question 9 - Average film length per category.

## Calculates the average duration of films for each category.
## Table used = "film, film_category, category"

In [31]:
query_9 = """
select c.name, Round(AVG(f.length), 2) AS avg_length
from film f
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON c.category_id = fc.category_id
Group by c.name;
"""
df_AvgFilmLength = pd.read_sql(query_9, conn)
df_AvgFilmLength.to_csv("../reports/Question9_AvgFilmLength.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\2572367403.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_AvgFilmLength = pd.read_sql(query_9, conn)

In [32]:
df_AvgFilmLength.head()

        name  avg_length
0     Action      111.61
1  Animation      111.02
2   Children      109.80
3   Classics      111.67
4     Comedy      115.83

## Question 10 - Category with the most rentals.

## Finds which category was rented the most.
## Table used = "rental, inventory, film, category"

In [33]:
query_10 = """
select c.name, Count(*) AS rental_count
from rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
Group by c.name
Order by rental_count DESC
Limit 1
"""
df_CategoryMostRentals = pd.read_sql(query_10, conn)
df_CategoryMostRentals.to_csv("../reports/Question10_CategoryMostRentals.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\245267975.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_CategoryMostRentals = pd.read_sql(query_10, conn)

In [34]:
df_CategoryMostRentals.head()

     name  rental_count
0  Sports          1179

## Question 11 - Number of rentals per month.

## Shows how many rentals happened in each month.
## Table used = "rental"

In [35]:
query_11 = """
select DATE_FORMAT(rental_date, '%Y-%m') AS month, Count(*) AS Results
from rental
Group by month
order by month
"""
df_MonthRentals = pd.read_sql(query_11, conn)
df_MonthRentals.to_csv("../reports/Question11_MonthRentals.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\2564972929.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_MonthRentals = pd.read_sql(query_11, conn)

In [36]:
df_MonthRentals.head()

     month  Results
0  2005-05     1156
1  2005-06     2311
2  2005-07     6709
3  2005-08     5686
4  2006-02      182

## Question 12 - Actor with the most film appearances.

## Finds the actor who appeared in the most films.
## Table used = "actor, film_actor"

In [37]:
query_12 = """
select a.first_name, a.last_name, count(*) AS film_count
from actor a
JOIN film_actor fa ON a.actor_id = fa.actor_id
Group by a.actor_id
Order by film_count DESC
Limit 1
"""
df_ActorAppearances = pd.read_sql(query_12, conn)
df_ActorAppearances.to_csv("../reports/Question12_Actor_Appearances.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\2551972544.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_ActorAppearances = pd.read_sql(query_12, conn)

In [38]:
df_ActorAppearances.head()

  first_name  last_name  film_count
0       GINA  DEGENERES          42

## Question 13 - List all customers along with the city they live in.

## Table used = "customer, address, city"

In [39]:
query_13 = """
select c.first_name, c.last_name, ci.city
from customer c
INNER JOIN address a ON c.address_id = a.address_id
INNER JOIN city ci ON a.city_id = ci.city_id;
"""
df_customersCity = pd.read_sql(query_13, conn)
df_customersCity.to_csv("../reports/Question13_Customers_City.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\3889978188.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_customersCity = pd.read_sql(query_13, conn)

In [40]:
df_customersCity.head()

  first_name last_name            city
0       MARY     SMITH          Sasebo
1   PATRICIA   JOHNSON  San Bernardino
2      LINDA  WILLIAMS         Athenai
3    BARBARA     JONES        Myingyan
4  ELIZABETH     BROWN          Nantou

## Question 14 - Show all employees and stores they work at.

## Table used = "staff, store"

In [41]:
query_14 = """
select s.first_name, s.last_name, st.store_id
from staff s
INNER JOIN store st ON s.store_id = st.store_id
"""
df_StoresEmployees = pd.read_sql(query_14, conn)
df_StoresEmployees.to_csv("../reports/Question14_Stores_Employees.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\2239060809.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_StoresEmployees = pd.read_sql(query_14, conn)

In [42]:
df_StoresEmployees.head()

  first_name last_name  store_id
0       Mike   Hillyer         1
1        Jon  Stephens         2

## Question 15 - Display all films and their corresponding language.

## Table used = "film, language"

In [43]:
query_15 = """
select f.title, l.name AS language
from film f
INNER JOIN language l ON f.language_id = l.language_id
"""
df_FilmLanguage = pd.read_sql(query_15, conn)
df_FilmLanguage.to_csv("../reports/Question15_Film_Language.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\2981174932.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_FilmLanguage = pd.read_sql(query_15, conn)

In [44]:
df_FilmLanguage.head()

              title language
0  ACADEMY DINOSAUR  English
1    ACE GOLDFINGER  English
2  ADAPTATION HOLES  English
3  AFFAIR PREJUDICE  English
4       AFRICAN EGG  English

## Question 16 - List actors and the films they've appeared in.

## Table used = "actor, film_actor, film"

In [45]:
query_16 = """
select a.first_name, a.last_name, f.title
from actor a
INNER JOIN film_actor fa ON a.actor_id = fa.actor_id
INNER JOIN film f ON fa.film_id = f.film_id;
"""
df_ListActors = pd.read_sql(query_16, conn)
df_ListActors.to_csv("../reports/Question16_List_Actors.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\1972622674.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_ListActors = pd.read_sql(query_16, conn)

In [46]:
df_ListActors.head()

  first_name last_name                  title
0   PENELOPE   GUINESS       ACADEMY DINOSAUR
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS
2   PENELOPE   GUINESS            ANGELS LIFE
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS
4   PENELOPE   GUINESS          CHEAPER CLYDE

## Question 17 - Show all films, even those that were never rented/LEFT JOIN.

## Table used = "film, inventory, rental"

In [47]:
query_17 = """
select f.title, r.rental_id
from film f
LEFT JOIN inventory i ON f.film_id = i.film_id
LEFT JOIN rental r ON i.inventory_id = r.inventory_id
WHERE r.rental_id IS NULL;
"""
df_FilmsNeverRented = pd.read_sql(query_17, conn)
df_FilmsNeverRented.to_csv("../reports/Question17_Films_Never_Rented.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\3153334463.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_FilmsNeverRented = pd.read_sql(query_17, conn)

In [48]:
df_FilmsNeverRented.head()

              title rental_id
0  ACADEMY DINOSAUR      None
1    ALICE FANTASIA      None
2       APOLLO TEEN      None
3    ARGONAUTS TOWN      None
4     ARK RIDGEMONT      None

## Question 18 - List all customers, including those who have never made a payment/LEFT JOIN.

## Table used = "customer, payment"

In [49]:
query_18 = """
select c.first_name, c.last_name, p.payment_id
from customer c
LEFT JOIN payment p ON c.customer_id = p.customer_id
WHERE payment_id IS NULL; 
"""
df_CustomerWithoutPayments = pd.read_sql(query_18, conn)
df_CustomerWithoutPayments.to_csv("../reports/Question18_Customers_Without_Payments.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\3912366319.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_CustomerWithoutPayments = pd.read_sql(query_18, conn)

In [50]:
df_CustomerWithoutPayments.head()

Empty DataFrame
Columns: [first_name, last_name, payment_id]
Index: []

## Question 19 - Show all categories and films assigned to them (NULL if none)/LEFT JOIN.

## Table used = "category, film_category, film"

In [51]:
query_19 = """
select c.name AS category, f.title
from category c
LEFT JOIN film_category fc ON c.category_id = fc.category_id
LEFT JOIN film f ON fc.film_id = f.film_id
"""
df_query19 = pd.read_sql(query_19, conn)
df_query19.to_csv("../reports/Question19_All_Categories_Films.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\3095874972.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_query19 = pd.read_sql(query_19, conn)

In [52]:
df_query19.head()

  category                title
0   Action         AMADEUS HOLY
1   Action      AMERICAN CIRCUS
2   Action   ANTITRUST TOMATOES
3   Action        ARK RIDGEMONT
4   Action  BAREFOOT MANCHURIAN